adelphes.android-dev-ext
ahmadawais.shades-of-purple
albert.TabOut
arcticicestudio.nord-visual-studio-code
azemoh.one-monokai
CoenraadS.bracket-pair-colorizer
Dart-Code.dart-code
Dart-Code.flutter
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
Equinusocio.vsc-community-material-theme
Equinusocio.vsc-material-theme
equinusocio.vsc-material-theme-icons
esbenp.prettier-vscode
FallenMax.mithril-emmet
formulahendry.code-runner
foxundermoon.shell-format
Gruntfuggly.todo-tree
hbenl.vscode-mocha-test-adapter
hbenl.vscode-test-explorer
idleberg.hopscotch
jeroen-meijer.pubspec-assist
jprestidge.theme-material-theme
k--kato.intellij-idea-keybindings
liviuschera.noctis
lkytal.FlatUI
mathiasfrohlich.Kotlin
maxmckinney.theme-smooth-yellow
ms-python.python
ms-vscode.cpptools
Nash.awesome-flutter-snippets
redhat.java
ritwickdey.LiveServer
s-nlf-fh.glassit
spoonscen.es6-mocha-snippets
tinkertrain.theme-panda
VisualStudioExptTeam.vscodeintellicode
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
whizkydee.material-palenight-theme
zhuangtongfa.material-theme
